---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.WireType
source: html/7f58242a-58fa-ae31-e6ba-de6ae96eff4f.htm
---
# WireType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.